docs/math/category-theory/categorification.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Categorification</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Categorification</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-f2bc58bc-0cd9-4ff4-a0ae-6c503a870c27">1. Examples</a>
<ul>
<li><a href="#h-325c10eb-0adc-4cc7-a447-b7400b0465ce">1.1. Stacks as Categorified Sheaves</a></li>
<li><a href="#h-d33913bd-706c-4ec4-aa9b-3e92ead6f949">1.2. Differential Calculus Categorifies as Goodwillie Calculus</a></li>
<li><a href="#h-cc9bae83-1051-4940-a1f6-ea2b7da67401">1.3. Categorifying Lie Algebras</a></li>
<li><a href="#h-ff682019-b62c-434b-97d3-1d5811fdb673">1.4. Number Theory</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-h-f2bc58bc-0cd9-4ff4-a0ae-6c503a870c27" class="outline-2">
<h2 id="h-f2bc58bc-0cd9-4ff4-a0ae-6c503a870c27"><span class="section-number-2">1.</span> Examples</h2>
<div class="outline-text-2" id="text-h-f2bc58bc-0cd9-4ff4-a0ae-6c503a870c27">
</div>

<div id="outline-container-h-325c10eb-0adc-4cc7-a447-b7400b0465ce" class="outline-3">
<h3 id="h-325c10eb-0adc-4cc7-a447-b7400b0465ce"><span class="section-number-3">1.1.</span> Stacks as Categorified Sheaves</h3>
<div class="outline-text-3" id="text-h-325c10eb-0adc-4cc7-a447-b7400b0465ce">
<p>
An $n$-stack is an $(n+1)$-sheaf.
</p>

<p>
If \(\cat{C}\) is an $n$-site, then we could define
<dfn>$n$-Sheaves</dfn> on \(\cat{C}\) as 2-sheaves taking values in
$(n-1)$-categories. (C.f., <a href="https://ncatlab.org/nlab/show/n-localic+2-topos#grothendieck_toposes">nLab</a> entry on $n$-localic 2-topos,
specifically Grothendieck $n$-toposes; and
<a href="https://ncatlab.org/nlab/show/n-localic+2-topos#sites_and_sheaves">n-localic 2-topos</a> entry's discussion of n-sheaves.)
</p>

<p>
We could also consider <a href="https://ncatlab.org/nlab/show/%28n%2C1%29-sheaf">$(n,1)$-sheafs</a> as higher versions.
</p>
</div>
</div>

<div id="outline-container-h-d33913bd-706c-4ec4-aa9b-3e92ead6f949" class="outline-3">
<h3 id="h-d33913bd-706c-4ec4-aa9b-3e92ead6f949"><span class="section-number-3">1.2.</span> Differential Calculus Categorifies as Goodwillie Calculus</h3>
<div class="outline-text-3" id="text-h-d33913bd-706c-4ec4-aa9b-3e92ead6f949">
<p>
The $(&infin;,1)$-categorification of differential calculus is the
Goodwillie calculus.
</p>
</div>
</div>

<div id="outline-container-h-cc9bae83-1051-4940-a1f6-ea2b7da67401" class="outline-3">
<h3 id="h-cc9bae83-1051-4940-a1f6-ea2b7da67401"><span class="section-number-3">1.3.</span> Categorifying Lie Algebras</h3>
<div class="outline-text-3" id="text-h-cc9bae83-1051-4940-a1f6-ea2b7da67401">
<p>
Basically, replace the vector spaces underlying Lie algebras with chain
complexes.
</p>

<ul class="org-ul">
<li>Dmitry Roytenberg,
"On weak Lie 2-algebras".
<a href="https://arxiv.org/abs/0712.3461">arXiv:0712.3461</a></li>
<li>Alissa S. Crans,
"Lie 2-Algebras".
<a href="https://arxiv.org/abs/math/0409602">arXiv:math/0409602</a>, 119 pages.</li>
<li>John C. Baez, Alissa S. Crans,
"Higher-Dimensional Algebra VI: Lie 2-Algebras".
<a href="https://arxiv.org/abs/math/0307263">arXiv:math/0307263</a>, 50 pages.</li>
<li>Chengming Bai, Yunhe Sheng, Chenchang Zhu,
"Lie 2-bialgebras".
<a href="https://arxiv.org/abs/1109.1344">arXiv:1109.1344</a>, 22 pages.</li>
<li>Malte Dehling,
"On weak Lie 3-algebras".
<a href="https://arxiv.org/abs/1710.11104">arXiv:1710.11104</a>, 39 pages.</li>
<li><a href="https://golem.ph.utexas.edu/category/2007/02/infinitely_categorified_calcul.html">https://golem.ph.utexas.edu/category/2007/02/infinitely_categorified_calcul.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-ff682019-b62c-434b-97d3-1d5811fdb673" class="outline-3">
<h3 id="h-ff682019-b62c-434b-97d3-1d5811fdb673"><span class="section-number-3">1.4.</span> Number Theory</h3>
<div class="outline-text-3" id="text-h-ff682019-b62c-434b-97d3-1d5811fdb673">
<ul class="org-ul">
<li>Mobius inversion
<a href="https://golem.ph.utexas.edu/category/2011/05/mbius_inversion_for_categories.html">https://golem.ph.utexas.edu/category/2011/05/mbius_inversion_for_categories.html</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-11-08 Mon 07:21.</p>
</div>
</body>
</html>